In [1]:
import numpy as np
import pandas as pd

In [ ]:
#Merging two data frames

In [5]:
employees = pd.DataFrame({
    "EmployeeID": [101, 102, 103, 104, 105],
    "Name": ["John", "Prachi", "Aku", "Riya", "Rina"],
    "Department": ["IT", "Finance", "HR", "Sales", "Designer"]
})

salaries = pd.DataFrame({
    "EmployeeID": [101, 102, 103, 106, 107],
    "Salary": [65000, 90000, 70000, 60000, 50000],
    "Bonus": [5000, 12000, 7000, 5000, 3000]   # Bonus added for each employee
})

In [6]:
employees

   EmployeeID    Name Department
0         101    John         IT
1         102  Prachi    Finance
2         103     Aku         HR
3         104    Riya      Sales
4         105    Rina   Designer

In [7]:
salaries

   EmployeeID  Salary  Bonus
0         101   65000   5000
1         102   90000  12000
2         103   70000   7000
3         106   60000   5000
4         107   50000   3000

In [12]:
pd.merge(employees,salaries, on='EmployeeID', how = 'inner')

   EmployeeID    Name Department  Salary  Bonus
0         101    John         IT   65000   5000
1         102  Prachi    Finance   90000  12000
2         103     Aku         HR   70000   7000

In [13]:
pd.merge(employees,salaries, on='EmployeeID', how = 'outer')

   EmployeeID    Name Department   Salary    Bonus
0         101    John         IT  65000.0   5000.0
1         102  Prachi    Finance  90000.0  12000.0
2         103     Aku         HR  70000.0   7000.0
3         104    Riya      Sales      NaN      NaN
4         105    Rina   Designer      NaN      NaN
5         106     NaN        NaN  60000.0   5000.0
6         107     NaN        NaN  50000.0   3000.0

In [14]:
pd.merge(employees,salaries, on='EmployeeID', how = 'left')

   EmployeeID    Name Department   Salary    Bonus
0         101    John         IT  65000.0   5000.0
1         102  Prachi    Finance  90000.0  12000.0
2         103     Aku         HR  70000.0   7000.0
3         104    Riya      Sales      NaN      NaN
4         105    Rina   Designer      NaN      NaN

In [15]:
pd.merge(employees,salaries, on='EmployeeID', how = 'right')

   EmployeeID    Name Department  Salary  Bonus
0         101    John         IT   65000   5000
1         102  Prachi    Finance   90000  12000
2         103     Aku         HR   70000   7000
3         106     NaN        NaN   60000   5000
4         107     NaN        NaN   50000   3000

In [16]:
#concatination of 2 dataframes

In [17]:
df1 = pd.DataFrame({
    'A':  ['A0', 'A1', 'A2'],
    'B':  ['B0', 'B1', 'B2'],
    'C':  ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A':  ['A3', 'A4', 'A5'],
    'B':  ['B3', 'B4', 'B5'],
    'C':  ['C3', 'C4', 'C5']
})

In [18]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [19]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [20]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [21]:
pd.concat([df1,df2], axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [ ]:
#Joining 2 dataframes

In [22]:
df1 = pd.DataFrame(
    {"Name": ["John", "Prachi", "Aku"]},
    index=[1, 2, 3])

df2 = pd.DataFrame(
    {"Score": [85, 90, 75]},
    index=[2, 3, 4]
)

In [23]:
df1

     Name
1    John
2  Prachi
3     Aku

In [24]:
df2

   Score
2     85
3     90
4     75

In [25]:
df1.join(df2)

     Name  Score
1    John    NaN
2  Prachi   85.0
3     Aku   90.0

In [26]:
df1.join(df2, how = 'outer')

     Name  Score
1    John    NaN
2  Prachi   85.0
3     Aku   90.0
4     NaN   75.0

In [27]:
df2.join(df1)

   Score    Name
2     85  Prachi
3     90     Aku
4     75     NaN